teomaras76/AI_on_STM32_Gesture_recognition/STM32 Sensortile FW project/Drivers/BSP/X_NUCLEO_IKS01A2/board/stm32_nucleo.h
/**
  ******************************************************************************
  * @file    stm32_nucleo.h
  * @author  MEMS Application Team
  * @version V4.0.0
  * @date    1-May-2017
  * @brief   This file contains definitions for the STM32 Nucleo boards
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2017 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __X_NUCLEO_IKS01A2_STM32_NUCLEO_H
#define __X_NUCLEO_IKS01A2_STM32_NUCLEO_H

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L0XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#ifdef USE_STM32F4XX_NUCLEO
#include "stm32f4xx_hal.h"
#endif

#ifdef USE_STM32L0XX_NUCLEO
#include "stm32l0xx_hal.h"
#endif

#ifdef USE_STM32L1XX_NUCLEO
#include "stm32l1xx_hal.h"
#endif

#ifdef USE_STM32L4XX_NUCLEO
#include "stm32l4xx_hal.h"
#endif

/** @addtogroup BSP NUCLEO
 * @{
 */

/** @addtogroup X_NUCLEO_IKS01A2 X_NUCLEO_IKS01A2
 * @{
 */

/** @addtogroup X_NUCLEO_IKS01A2_NUCLEO NUCLEO
 * @{
 */

/** @addtogroup X_NUCLEO_IKS01A2_NUCLEO_Public_Constants Public constants
 * @{
 */
/* I2C clock speed configuration (in Hz) */
#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)))
#define BOARD_I2C_EXPBD_SPEED                      400000
#endif /* USE_STM32F4XX_NUCLEO or USE_STM32L1XX_NUCLEO */

/* Timing samples for L0 with SYSCLK 32MHz set in SystemClock_Config() */
#if (defined (USE_STM32L0XX_NUCLEO))
#define BOARD_I2C_EXPBD_TIMING_100KHZ              0x10A13E56 /* Analog Filter ON, Rise Time 400ns, Fall Time 100ns */
#define BOARD_I2C_EXPBD_TIMING_400KHZ              0x00B1112E /* Analog Filter ON, Rise Time 250ns, Fall Time 100ns */
#endif /* USE_STM32L0XX_NUCLEO */

/* Timing samples for L4 with SYSCLK 80MHz set in SystemClock_Config() */
#if (defined (USE_STM32L4XX_NUCLEO))
#define BOARD_I2C_EXPBD_TIMING_100KHZ              0x30C14E6B /* Analog Filter ON, Rise Time 400ns, Fall Time 100ns */
#define BOARD_I2C_EXPBD_TIMING_400KHZ              0x10D1143A /* Analog Filter ON, Rise time 250ns, Fall Time 100ns */
#define BOARD_I2C_EXPBD_TIMING_1000KHZ             0x00D00E28 /* Analog Filter ON, Rise time 120ns, Fall time 25ns */
#endif /* USE_STM32L4XX_NUCLEO */

/* I2C peripheral configuration defines */
#define BOARD_I2C_EXPBD                            I2C1
#define BOARD_I2C_EXPBD_CLK_ENABLE()               __I2C1_CLK_ENABLE()
#define BOARD_I2C_EXPBD_SCL_SDA_GPIO_CLK_ENABLE()  __GPIOB_CLK_ENABLE()
#define BOARD_I2C_EXPBD_SCL_SDA_AF                 GPIO_AF4_I2C1
#define BOARD_I2C_EXPBD_SCL_SDA_GPIO_PORT          GPIOB
#define BOARD_I2C_EXPBD_SCL_PIN                    GPIO_PIN_8
#define BOARD_I2C_EXPBD_SDA_PIN                    GPIO_PIN_9  /* Ard D14 */

#define BOARD_I2C_EXPBD_FORCE_RESET()              __I2C1_FORCE_RESET()
#define BOARD_I2C_EXPBD_RELEASE_RESET()            __I2C1_RELEASE_RESET()

/* I2C interrupt requests */
#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define BOARD_I2C_EXPBD_EV_IRQn                    I2C1_EV_IRQn
#define BOARD_I2C_EXPBD_ER_IRQn                    I2C1_ER_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define BOARD_I2C_EXPBD_EV_IRQn                    I2C1_IRQn
#endif

#define BOARD_I2C_EXPBD_SET_CLK_SOURCE()           do { } while(0)

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)))
#define BOARD_I2C_EXPBD_SET_CLK_SPEED(x)           do { \
                                                      (x)->ClockSpeed = BOARD_I2C_EXPBD_SPEED; \
                                                      (x)->DutyCycle  = I2C_DUTYCYCLE_2; \
                                                    } while(0)
#else
#define BOARD_I2C_EXPBD_TIMING                     BOARD_I2C_EXPBD_TIMING_400KHZ
#define BOARD_I2C_EXPBD_SET_CLK_SPEED(x)           do { \
                                                      (x)->Timing = BOARD_I2C_EXPBD_TIMING; \
                                                    } while(0)
#endif

#if (defined (USE_STM32L4XX_NUCLEO))
#define BOARD_I2C_EXPBD_SET_FAST_MODE()            do { \
                                                      if(BOARD_I2C_EXPBD_TIMING == BOARD_I2C_EXPBD_TIMING_1000KHZ) \
                                                      { \
                                                        HAL_I2CEx_EnableFastModePlus( I2C_FASTMODEPLUS_I2C1 ); \
                                                      } \
                                                    } while(0)
#else
#define BOARD_I2C_EXPBD_SET_FAST_MODE()            do { } while(0)
#endif
#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L0XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define BOARD_I2C_EXPBD_GPIO_SPEED                 GPIO_SPEED_FAST
#endif

#if (defined (USE_STM32L1XX_NUCLEO))
#define BOARD_I2C_EXPBD_GPIO_SPEED                 GPIO_SPEED_MEDIUM
#endif

#define BOARD_I2C_EXPBD_IRQ_PRI_LEVEL              0x8

/* Maximum Timeout values for flags waiting loops. These timeouts are not based
   on accurate values, they just guarantee that the application will not remain
   stuck if the I2C communication is corrupted.
   You may modify these timeout values depending on CPU frequency and application
   conditions (interrupts routines ...). */
#define BOARD_I2C_EXPBD_TIMEOUT_MAX                0x1000 /*<! The value of the maximal timeout for BUS waiting loops */

/* Definition for interrupt Pins */
#define LPS22H_INT1_O_GPIO_PORT                     GPIOB
#define LPS22H_INT1_O_GPIO_CLK_ENABLE()             __GPIOB_CLK_ENABLE()
#define LPS22H_INT1_O_GPIO_CLK_DISABLE()            __GPIOB_CLK_DISABLE()
#define LPS22H_INT1_O_PIN                           GPIO_PIN_10

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define LPS22H_INT1_O_EXTI_IRQn                     EXTI15_10_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define LPS22H_INT1_O_EXTI_IRQn                     EXTI4_15_IRQn
#endif

#define LSM6DSL_INT1_O_GPIO_PORT                    GPIOB
#define LSM6DSL_INT1_O_GPIO_CLK_ENABLE()            __GPIOB_CLK_ENABLE()
#define LSM6DSL_INT1_O_GPIO_CLK_DISABLE()           __GPIOB_CLK_DISABLE()
#define LSM6DSL_INT1_O_PIN                          GPIO_PIN_5

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define LSM6DSL_INT1_O_EXTI_IRQn                    EXTI9_5_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define LSM6DSL_INT1_O_EXTI_IRQn                    EXTI4_15_IRQn
#endif

#define M_INT1_O_GPIO_PORT                          GPIOC
#define M_INT1_O_GPIO_CLK_ENABLE()                  __GPIOC_CLK_ENABLE()
#define M_INT1_O_GPIO_CLK_DISABLE()                 __GPIOC_CLK_DISABLE()
#define M_INT1_O_PIN                                GPIO_PIN_0

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define M_INT1_O_EXTI_IRQn                          EXTI0_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define M_INT1_O_EXTI_IRQn                          EXTI0_1_IRQn
#endif

#define M_INT2_O_GPIO_PORT                          GPIOC
#define M_INT2_O_GPIO_CLK_ENABLE()                  __GPIOC_CLK_ENABLE()
#define M_INT2_O_GPIO_CLK_DISABLE()                 __GPIOC_CLK_DISABLE()
#define M_INT2_O_PIN                                GPIO_PIN_1

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define M_INT2_O_EXTI_IRQn                          EXTI1_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define M_INT2_O_EXTI_IRQn                          EXTI0_1_IRQn
#endif

#define LSM6DSL_INT2_O_GPIO_PORT                    GPIOB
#define LSM6DSL_INT2_O_GPIO_CLK_ENABLE()            __GPIOB_CLK_ENABLE()
#define LSM6DSL_INT2_O_GPIO_CLK_DISABLE()           __GPIOB_CLK_DISABLE()
#define LSM6DSL_INT2_O_PIN                          GPIO_PIN_4

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define LSM6DSL_INT2_O_EXTI_IRQn                    EXTI4_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define LSM6DSL_INT2_O_EXTI_IRQn                    EXTI4_15_IRQn
#endif

/* Ready for use */
#define USER_INT_O_GPIO_PORT                        GPIOA
#define USER_INT_O_GPIO_CLK_ENABLE()                __GPIOA_CLK_ENABLE()
#define USER_INT_O_GPIO_CLK_DISABLE()               __GPIOA_CLK_DISABLE()
#define USER_INT_O_PIN                              GPIO_PIN_10

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define USER_INT_O_EXTI_IRQn                        EXTI15_10_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define USER_INT_O_EXTI_IRQn                        EXTI4_15_IRQn
#endif

/* Ready for use */
#define LSM303AGR_DRDY_O_GPIO_PORT                  GPIOA
#define LSM303AGR_DRDY_O_GPIO_CLK_ENABLE()          __GPIOA_CLK_ENABLE()
#define LSM303AGR_DRDY_O_GPIO_CLK_DISABLE()         __GPIOA_CLK_DISABLE()
#define LSM303AGR_DRDY_O_PIN                        GPIO_PIN_4

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define LSM303AGR_DRDY_O_EXTI_IRQn                  EXTI4_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define LSM303AGR_DRDY_O_EXTI_IRQn                  EXTI4_15_IRQn
#endif

/* Ready for use */
#define LSM303AGR_INT_O_GPIO_PORT                   GPIOB
#define LSM303AGR_INT_O_GPIO_CLK_ENABLE()           __GPIOB_CLK_ENABLE()
#define LSM303AGR_INT_O_GPIO_CLK_DISABLE()          __GPIOB_CLK_DISABLE()
#define LSM303AGR_INT_O_PIN                         GPIO_PIN_0

#if ((defined (USE_STM32F4XX_NUCLEO)) || (defined (USE_STM32L1XX_NUCLEO)) || (defined (USE_STM32L4XX_NUCLEO)))
#define LSM303AGR_INT_O_EXTI_IRQn                   EXTI0_IRQn
#endif

#if (defined (USE_STM32L0XX_NUCLEO))
#define LSM303AGR_INT_O_EXTI_IRQn                   EXTI0_1_IRQn
#endif

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* USE_STM32F4XX_NUCLEO || USE_STM32L0XX_NUCLEO || USE_STM32L1XX_NUCLEO || USE_STM32L4XX_NUCLEO */

#endif /* __X_NUCLEO_IKS01A2_STM32_NUCLEO_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
